app/views/shops/show.html.erb

  <div class="">
    <% if @shop.shop_images.present? %>
      <% @shop.shop_images.each do |image| %>
---
SELECT "shop_images".* FROM "shop_images" WHERE "shop_images"."shop_id" = ?  [["shop_id", "3"]]
SELECT "shop_images".* FROM "shop_images" WHERE "shop_images"."shop_id" = ?  [["shop_id", 1]]

</div>
<% @shop.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 3]]