app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
        <div class="reviewed-shops-list">
          <% @user.posts.each do |post| %>