app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.shop_id = params[:id]
    @post.user_id = current_user.id
    @post.post_total_point = (@post.congestion.to_f + @post.menu.to_f + @post.price.to_f + @post.wifi.to_f + @post.others.to_f) / 5
    if @post.save
---
INSERT INTO "posts" ("shop_id", "user_id", "post_total_point", "congestion", "menu", "price", "wifi", "others", "created_at", "updated_at", "review") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
      @post.post_total_point = (@post.congestion.to_f + @post.menu.to_f + @post.price.to_f + @post.wifi.to_f + @post.others.to_f) / 5
      @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "congestion" = ?, "menu" = ?, "price" = ?, "wifi" = ?, "others" = ?, "post_total_point" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["congestion", 3], ["menu", 4], ["price", 3], ["wifi", 4], ["others", 3], ["post_total_point", 5.0], ["updated_at", "2020-02-24 08:22:08.484466"], ["id", 2]]
UPDATE "posts" SET "congestion" = ?, "menu" = ?, "price" = ?, "wifi" = ?, "others" = ?, "post_total_point" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["congestion", 3], ["menu", 4], ["price", 3], ["wifi", 4], ["others", 3], ["post_total_point", 4.4], ["updated_at", "2020-02-24 08:28:55.089561"], ["id", 2]]