app/controllers/shops_controller.rb

  def index
    @q = Shop.ransack(params[:q])
    @shop = @q.result
    @shop.each do |shop|
      if shop.posts.average(:post_total_point) != nil
        shop.total_point = shop.posts.average(:post_total_point).floor(2)
---
SELECT AVG("posts"."post_total_point") FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 1]]

  def create
    @shop = Shop.new(shop_params)
    if @shop.save
---
INSERT INTO "shops" ("name", "station_name", "created_at", "updated_at", "branch", "furigana") VALUES (?, ?, ?, ?, ?, ?)  [["name", "タリーズコーヒー"], ["station_name", "金町"], ["created_at", "2020-02-24 13:52:34.531477"], ["updated_at", "2020-02-24 13:52:34.531477"], ["branch", "金町店"], ["furigana", "タリーズコーヒーカナマチテン"]]

  def show
    @shop = Shop.find(params[:id])
    if @shop.posts.average(:post_total_point) != nil
      @shop.total_point = @shop.posts.average(:post_total_point).floor(2)
      @shop.ave_congestion = @shop.posts.average(:congestion).floor(2)
      @shop.ave_menu = @shop.posts.average(:menu).floor(2)
      @shop.ave_price = @shop.posts.average(:price).floor(2)
      @shop.ave_wifi = @shop.posts.average(:wifi).floor(2)
      @shop.ave_others = @shop.posts.average(:others).floor(2)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 1]]
SELECT AVG("posts"."post_total_point") FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 1]]
SELECT AVG("posts"."congestion") FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 1]]
SELECT AVG("posts"."menu") FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 1]]
SELECT AVG("posts"."price") FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 1]]
SELECT AVG("posts"."wifi") FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 1]]
SELECT AVG("posts"."others") FROM "posts" WHERE "posts"."shop_id" = ?  [["shop_id", 1]]