app/controllers/shops_controller.rb

  def index
    if params[:q].present?
      @q = Shop.ransack(search_params)
      @shop = @q.result
    else
      @q = Shop.ransack()
      @shop = Shop.all
---
SELECT "shops".* FROM "shops"

  def search
    if params[:q].present?
      @q = Shop.ransack(search_params)
      @shop = @q.result
    else
      @q = Shop.ransack()
      @shop = Shop.all
---
SELECT "shops".* FROM "shops"