app/models/post.rb

  def shop
    return Shop.find(self.shop_id)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]